Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/back_to_education/back_to_education_allowance.html.txt.tmx
Source language: en
Languages: ga

source: Before 2 June 2015, a qualified adult of a person who can claim BTEA could qualify for BTEA in their own right
ga: Roimh an 2 Meitheamh 2015, d’fhéadfadh daoine ar dhuine fásta cáilithe iad le duine ar féidir leis/lei LFAO a éileamh, cáiliú do LFAO ina gceart féin

source: Both partners can get BTEA while taking an approved course
ga: Féadfaidh an bheirt pháirtnéirí LFAO a fháil agus iad ag tabhairt faoi chúrsa faofa

source: You must provide a certificate from the school/college confirming your registration, commencement and attendance at the course
ga: Ní mór duit deimhniú a sholáthar ón scoil/gcoláiste a dheimhníonn do chlárú, do thosú agus d’fhreastal ar an gcúrsa

source: You must supply this information before payment can begin
ga: Ní mór duit an fhaisnéis seo a sholáthar sular féidir tús a chur le híocaíocht

source: During the course of the academic year, you may be asked to provide confirmation that you are still taking part in the course
ga: Le linn na bliana acadúla, d’fhéadfadh go n-iarrfar ort dearbhú a sholáthar go bhfuil páirt fós á glacadh agat sa chúrsa

source: If you change from a jobseeker's payment to BTEA, you do not need to sign on while you are getting BTEA
ga: Má aistríonn tú ó íocaíocht chuardaitheora poist chuig an BTEA, ní gá duit síniú ag d’Oifig Áitiúil Leasa Shóisialaigh fad atá an BTEA á fháil agat

source: BTEA and other payments
ga: An BTEA agus íocaíochtaí eile

source: People getting a Back Education Allowance cannot work full-time and are not eligible for Community Employment, Social Economy Programme, Tús, Rural Social Scheme, any other FET (formerly FÁS) or Fáilte Ireland training programmes, Work Placement Programme, JobBridge, Part-time Job Incentive Scheme or any other employment or training scheme or programme operated by the National Learning Network
ga: Níl daoine a bhfuil Liúntas um Fhilleadh ar Oideachas á fháil acu i dteideal tabhairt faoi Fhostaíocht Pobail, Clár an Gheilleagair Shóisialta, Tús, Scéim Shóisialta Tuaithe, aon chláir oiliúna FET (FÁS roimhe seo) nó Fháilte Éireann, Clár Socrúchán Oibre, JobBridge nó Scéim Dreasachta Poist Pháirtaimseartha

source: People getting a Back to Education Allowance are not eligible for Family Income Supplement (FIS)
ga: Níl daoine a bhfuil Liúntas um Fhilleadh ar Oideachas á fháil acu i dteideal Forlíonadh Ioncam Teaghlaigh (FIT) a fháil

source: BTEA and part-time work
ga: An BTEA agus obair pháirtaimseartha

source: Since the 2016/2017 academic year, people getting BTEA who take up work during the academic year will be assessed under the rules (including means assessment) that apply to their primary payment - the payment they qualified for BTEA from
ga: Ón bhliain acadúil 2016/2017, má fhaigheann tú LFO agus má ghlacann tú obair i rith na bliana acadúla, measfar do chás de réir na rialacha (ina measc, measúnú ioncaim) a bhaineann le do príomhíocaíocht - an íocaíocht a cháilíonn tú le haghaidh LFO

source: This only applies to new applicants or people who return to BTEA after a break
ga: Baineann an riail nua seo le daoine a thosaigh ar LFO sa bhliain acadúil 2016/2017 nó a d'fhill ar LFO sa bhliain acadúil 2016/2017 tar éis bheith ar bhriseadh

source: Previously, part-time work during the academic year did not affect the rate of BTEA paid
ga: Roimhe seo, níor imir obair pháirtaimseartha i rith na bliana acadúla aon tionchar ar an ráta LFO

source: If you were getting a jobseeker’s payment before going back to education, your BTEA is not paid over the summer months period between academic years
ga: Má bhí íocaíocht chuardaitheora poist á fáil agat sular fhill tú ar oideachas, ní íoctar do BTEA i gcaitheamh thréimhse mhíonna an tsamhraidh idir na blianta acadúla

source: (It will be paid from the start of the new academic year provided you continue to satisfy the eligibility criteria.)
ga: (Íocfar é ó thús na bliana nua acadúla a fhad agus a leanann tú leis na critéir cháilitheachta a shásamh)

source: If you were getting a One-Parent Family Payment, Jobseeker's Transitional payment or a disability payment before going back to education, your BTEA will continue to be paid over the summer provided you are returning to an approved course and are progressing in your education
ga: Murar féidir leat obair a aimsiú i gcaitheamh thréimhse an tsamhraidh, b’fhéidir go bhfuil tú i dteideal Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist a fháil. Ní mór duit na coinníollacha go léir a chomhlíonadh, lena n-áirítear bheith in ann obair a dhéanamh, fáil a bheith ort chun obair a dhéanamh agus fíor-iarracht a bheith á déanamh agat chun obair a chuardach

source: If you work over the summer your means from work are assessed using the rules that apply to the original payment
ga: Má éilíonn tú Liúntas Cuardaitheora Poist (LCP) agus má oibríonn tú go páirtaimseartha, measúnaítear do thuillimh i leith do LCP

source: If you stop work or your work pattern changes you should inform your Intreo centre so your case can be reassessed
ga: Má stopann tú ag oibriú nó má thagann athrú ar do phatrún oibre, ba cheart duit d’ionad Intreo a chur ar an eolas ionas gur féidir athmheasúnú a dhéanamh ar do chás

source: If you are a new BTEA participant aged over 26, your weekly BTEA rate will be equal to your previous social protection payment (the payment that qualified you for participation in the scheme)
ga: Más rannpháirtí nua BTEA thú atá os cionn 26 bliain d’aois, is ionann a bheidh do ráta seachtainiúil den BTEA agus d’íocaíocht dheireanach coimirce sóisialaí (an íocaíocht a cháiligh thú do rannpháirtíocht sa scéim)

source: You may also qualify for increases for a qualified adult and qualified children
ga: Anuas air sin, d’fhéadfá cáiliú do mhéaduithe do dhuine fásta cáilithe agus do leanaí cáilithe

source: If you are a new participant aged under 26 and you were getting a reduced age-related Jobseeker's Allowance payment, you will get a new personal maximum BTEA rate of €160 (increasing to €193 from September 2017). Any means you have will be deducted from this rate
ga: Más rannpháirtí nua thú atá faoi bhun 26 bliain d’aois agus má bhí íocaíocht laghdaithe aoischoibhneasa Cuardaitheora Poist á fáil agat, gheobhaidh tú uasráta nua pearsanta €160 den BTEA (asbhainfear aon mhaoin atá agat ón ráta seo)

source: You can get your Back to Education Allowance paid directly to your bank account
ga: Íoctar an Liúntas um Fhilleadh ar Oideachas ar an mbealach céanna le d’íocaíocht reatha leasa shóisialaigh

source: It is paid for the duration of the course
ga: Íoctar é ar feadh fhad an chúrsa

source: If you were previously getting a jobseeker's payment, you do not get the Back to Education Allowance during the summer period between academic years
ga: Má bhí íocaíocht chuardaitheora poist á fáil agat roimhe seo, ní fhaigheann tú an Liúntas um Fhilleadh ar Oideachas le linn thréimhse an tsamhraidh idir na blianta acadúla.Rachaidh d’oifig leasa shóisialaigh áitiúil i dteagmháil leat i Márta nó Aibreán chun dáta d’fhreastal dheireanach le haghaidh na bliana acadúla reatha a fhiafraí. Ní íocfar BTEA leat i ndiaidh an dáta seo

source: Your Intreo Centre will contact you in March or April to ask the date of last attendance for the current academic year and you will not be paid BTEA beyond this date
ga: Is féidir leat iarratas a dhéanamh ar Shochar Cuardaitheora Poist nó ar Liúntas Cuardaitheora Poist, áfach, má chomhlíonann tú na coinníollacha cáilithe

source: You may get BTEA during the summer if you are on work placement or work experience that is an essential part of your course
ga: Féadfaidh tú an BTEA a fháil le linn an tsamhraidh má tá tú ar shocrúchán oibre nó ar thaithí oibre atá mar chuid lárnach de do chúrsa

source: If you defer a year of study you are treated as a new entrant when you return to your course
ga: Má chuireann tú bliain staidéir siar, caitear leat mar iontrálaí nua nuair a fhilleann tú ar do chúrsa

source: Cost of Education Allowance
ga: Do chuid sochair thánaisteacha a choimeád

source: From September 2017, you will get an annual Cost of Education Allowance of €500 if you are getting BTEA and you have a dependent child. Keeping your extra benefits
ga: Má cháilítear thú don Liúntas um Fhilleadh ar Oideachas, is féidir leat do theidlíocht i leith aon sochar tánaisteach atá agat cheana féin a choimeád, mar shampla, Liúntas Breosla, Forlíonadh Cíosa agus Forlíonadh Ús Morgáiste

source: If you qualify for the Back to Education Allowance, you can keep your entitlement to any extra benefits you already have, for example, Fuel Allowance or Rent Supplement
ga: D’fhéadfadh aon mhéadú ar ioncam tionchar a imirt ar do theidlíocht i leith Forlíonadh Cíosa/Ús Morgáiste nó an méid den fhorlíonadh a fhaigheann tú, áfach

source: However, any increase in income may affect your entitlement to Rent Supplement or the amount of supplement you get. For example, this can happen if you have additional income from part-time work
ga: Mar shampla, d’fhéadfadh seo tarlú má bhogann tú ó íocaíocht laghdaithe leasa shóisialaigh chuig an ráta caighdeánach den BTEA

source: When you are accepted on a course, you should notify the Department of Social Protection by filling in the Back to Education Allowance application form (pdf), which is also available from your Intreo Centre
ga: Ní mór duit, nuair a ghlactar ar chúrsa tú, an Roinn Coimirce Sóisialaí a chuir ar an eolas trí foirm iarratais don Liúntas um Fhilleadh ar Oideachas (pdf) a íoschóipeáil, a líonadh isteach agus a sheoladh chucu

source: All new BTEA claims for jobseekers must be recommended by a DSP Case Officer before a decision can be made on your BTEA entitlement
ga: Tá an fhoirm le fáil ó do Oifig Leasa Shóisialaigh áitiúil chomh maith

source: You must get written confirmation that you are registered as a full-time day student from the college registrar or admission officer
ga: Ní mór duit dearbhú i scríbhinn a fháil go bhfuil tú cláraithe mar mhac léinn lae lánaimseartha ó oifigeach iontrála nó ó chláraitheoir an choláiste

source: You will not get payment of BTEA until you give this confirmation letter to the Department of Social Protection
ga: Ní bhfaighidh tú íocaíocht den Liúntas um Fhilleadh ar an Oideachas go dtí go dtabharfaidh tú an litir dhearbhaithe seo don Roinn Coimirce Sóisialaí

source: You must apply for BTEA before your course starts (or within 30 days of the course starting)
ga: Glacfar le hiarratas deireanach má tá cúis mhaith leis a bheith deireanach agus má fhaigheann an rannóg cuí den Roinn é taobh istigh de 30 lá ó thús an chúrsa

source: Send your application to the section in the Department of Social Protection that deals with your payments – see ‘Where to apply’ below
ga: Seol d’fhoirm iarratais chuig an rannóg sa Roinn Coimirce Sóisialaí a láimhseálann d’íocaíochtaí - féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: The Back to Education Allowance is a non-statutory scheme
ga: Scéim neamhreachtúil is ea an Liúntas um Fhilleadh ar Oideachas

source: This means that decisions cannot be appealed to the Social Welfare Appeals Office
ga: Ciallaíonn seo nach féidir cinntí a achomharc leis an Oifig Achomharc Leasa Shóisialaigh

source: If you are not satisfied with a decision you may request within 21 days (in writing) a review by an officer of the relevant social welfare office or section, enclosing any new evidence in support of the review
ga: Mura bhfuil tú sásta le cinneadh, is féidir leat a iarraidh (i scríbhinn) go ndéanfaidh oifigeach den Oifig ábhartha Áitiúil Leasa Shóisialaigh nó an Rannóg ábhartha den Roinn, athreithniú trí aon fhianaise nua a thacaíonn leis an athbhreithniú a chur faoi iamh

source: If you are getting a jobseeker's payment, Farm Assist or a One-Parent Family payment you should return your application form to your Intreo Centre
ga: Má fhaigheann tú íocaíocht cuardaitheora poist, caithfidh tú do fhoirm iarratas a sheol chuig le d'ionad Intreo nó d’oifig leasa shóisialaigh áitiúil

source: If you are getting Illness Benefit contact Back to Education Section:
ga: Má fhaigheann tú Sochar Breoiteachta, teigh i dteagmháil le:

source: Department of Social Protection
ga: An Roinn Coimirce Sóisialaí

source: If you are getting Blind Pension, a deserted wife's payment, Widow's, Widower's or Surviving Partner's (Non-Contributory) Pension, or Widow's, Widower's or Surviving Partner's (Contributory) Pension contact:
ga: Ma fhaigheann tú Íocaíocht Teaghlaigh Aontuismitheora, íocaíocht do mhná céile tréigthe, Pinsean Neamh-ranníocach do Bhaintreach nó do Bhaintreach Fir Pinsean Ranníocach do Bhaintreach nó do Bhaintreach Fir nó Pinsean na nDall, teigh i dteagmháil le:

source: Opening Hours:This office does not offer a service to personal callers
ga: Uaireanta Oscailte:Ní thairgeann an oifig seo seirbhís do chuairteoirí pearsanta

source: All queries must be made using the online enquiry form, by telephone or in writing
ga: Caithfidh gach ceist a bheith cur isteach tríd an fhoirm fiosraithe ar líne a úsáid, tríd an teileafón nó i scríbhinn
